In [166]:
import pandas as pd

titanic_df = pd.read_csv('../data/titanic/train.csv')
titanic_df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [167]:
titanic_df[['Age', 'Fare']].mean(axis=1)

0      14.62500
1      54.64165
2      16.96250
3      44.05000
4      21.52500
         ...
886    20.00000
887    24.50000
888    23.45000
889    28.00000
890    19.87500
Length: 891, dtype: float64

In [168]:
titanic_df[['Age','Fare']].sum(axis=0)

Age     21205.1700
Fare    28693.9493
dtype: float64

In [169]:
titanic_df[['Age', 'Fare']].count(axis=0)

Age     714
Fare    891
dtype: int64

In [170]:
titanic_group_by = titanic_df.groupby(by='Pclass').count()
titanic_group_by

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Pclass,,,,,,,,,,,
1,216,216,216,216,186,216,216,216,216,176,214
2,184,184,184,184,173,184,184,184,184,16,184
3,491,491,491,491,355,491,491,491,491,12,491

In [171]:
print(type(titanic_group_by))
print(titanic_group_by.shape)
print(titanic_group_by.index)

<class 'pandas.core.frame.DataFrame'>
(3, 11)
Int64Index([1, 2, 3], dtype='int64', name='Pclass')

In [172]:
titanic_group_by = titanic_df.groupby('Pclass')[['PassengerId', 'Survived']].count()
titanic_group_by

        PassengerId  Survived
Pclass
1               216       216
2               184       184
3               491       491

In [173]:
titanic_df['Pclass'].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [174]:
titanic_df.groupby('Pclass')['Age'].agg([max,min])

         max   min
Pclass
1       80.0  0.92
2       70.0  0.67
3       74.0  0.42

In [175]:
titanic_df.groupby('Pclass').agg({'Age':'max', 'SibSp':'sum', 'Fare':'mean'})

         Age  SibSp       Fare
Pclass
1       80.0     90  84.154687
2       70.0     74  20.662183
3       74.0    302  13.675550

In [176]:
titanic_df.isna().head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False

In [177]:
titanic_df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [178]:
titanic_df['Cabin'] = titanic_df['Cabin'].fillna('C000')
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,C000,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,C000,S

In [179]:
a = [1,2,3]
squares = map(lambda x: x**2, a)
list(squares)

[1, 4, 9]

In [180]:
lambda_square = lambda x:x**2
titanic_df['Name_Len'] = titanic_df['Name'].apply(lambda x:len(x))
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Name_Len
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,C000,S,23
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,51
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,C000,S,22

In [181]:
titanic_df['Child_Adult'] = titanic_df['Age'].apply(lambda x: 'Child' if x <= 15 else 'Adult')
titanic_df[['Age', 'Child_Adult']].head(3)

    Age Child_Adult
0  22.0       Adult
1  38.0       Adult
2  26.0       Adult

In [182]:
titanic_df['Age_Cat'] = titanic_df['Age'].apply(lambda x: 'Child' if x<= 15 else ('Adult' if x <= 60 else 'Elderly'))
titanic_df['Age_Cat'].head(3)

0    Adult
1    Adult
2    Adult
Name: Age_Cat, dtype: object

In [183]:
def get_category(age):
    cat = ''
    if age <= 5: cat = 'Baby'
    elif age <= 12: cat = 'Child'
    elif age <= 18: cat = 'Teenager'
    elif age <= 25: cat = 'Student'
    else : cat = 'Elderly'
    return cat

In [184]:
def get_name_age(age, name):
    return '{} : {}'.format(age, name)

In [185]:
titanic_df['Age_Name'] = titanic_df[['Age','Name']].apply(lambda x:get_name_age(x.Age, x.Name), axis=1)
titanic_df['Age_Name'].head(3)

0                       22.0 : Braund, Mr. Owen Harris
1    38.0 : Cumings, Mrs. John Bradley (Florence Br...
2                        26.0 : Heikkinen, Miss. Laina
Name: Age_Name, dtype: object

In [186]:
def get_age_fare(age, fare):
    return age - fare

#꼼수(?)
titanic_df['Age_Fare'] = None
#titanic_df['Age'].apply(get_age_fare, args=(titanic_df['Fare'],))
#titanic_df['Age_Fare'] = titanic_df['Age'].apply(get_age_fare, fare=1)
titanic_df['Age_Fare'] = titanic_df['Age'].apply(lambda x:get_age_fare(age=x,fare=titanic_df['Fare']))
titanic_df[['Age_Fare', 'Age', 'Fare']].head(3)

   Age_Fare   Age     Fare
0     14.75  22.0   7.2500
1     30.75  38.0  71.2833
2     18.75  26.0   7.9250